# commit - збереження змін у коді, хто зробив зміни, що змінено і т.д.
# pull request - запит на оновлення даних
# червоний файл гіт не бачить
# зелений - доданий до гіта, але не закомічений
# блакитний - файл доданий до гіта, і в якому були якісь зміни
# сірий - поточний файл без змін, гіт бачить його його
# git init - ініціалізація гіта, щоб гіт слідкував за проектом
# git status - інформація поточного стану проекту
# git branch -M main - пеерейменування головної гілки
# git add main.py - додавання файлу до гіта
# git commit -m "Initial commit" - коміт файлу (зміна) і коментар
# clear - очистити консоль
# git log - що відбувалося в проекті
# git add . - додати всі файли до гіта
# репозиторій - проект, за яким слідкує гіт
# origin - посилання на репозиторій https://github.com/SviatoslavIshchenko/git-practice.git
# git remote add origin https://github.com/SviatoslavIshchenko/git-practice.git
# git-learning> git remote -v - підключення до сервера і отримання інформації
# git push -u origin main - відправлення оновлених файлів на Гітхаб при першому відправленні
# git pull - відправлення коду на локальний компютер
# git push - відправлення оновлених файлів на Гітхаб
# git diff - показати різницю між файлами в більшості на сервері

print("Hello Git!!!")
print(5+5)

