# commit - збереження змін у коді, хто зробив зміни, що змінено і т.д.
# pull request - запит на оновлення даних
# червоний файл гіт не бачить
# зелений - доданий до гіта, але не закомічений
# блакитний - файл доданий до гіта, і в якому були якісь зміни
# сірий - поточний файл без змін, гіт бачить його його
# git init - ініціалізація гіта, щоб гіт слідкував за проектом
# git status - інформація поточного стану проекту
# git branch -M main - пеерейменування головної гілки
# git add main.py - додавання файлу до гіта
# git commit -m "Initial commit" - коміт файлу (зміна) і коментар
# clear - очистити консоль
# git log - що відбувалося в проекті
# git add . - додати всі файли до гіта
# репозиторій - проект, за яким слідкує гіт



print("Hello Git")

